snowflake_contents/github/bi_applications_sharing/sfguide-tasty-bytes-zero-to-app/backend/load_test/load_test.yaml
config:
  target: "http://localhost:3000"
  http:
      # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
      timeout: 180  
  processor: "./load_test_helper.js"
  phases:
    - duration: 100
      arrivalRate: 10
      rampTo: 50
      
scenarios:
  - name: "Get basic data"
    flow:
      - post:
          url: "/login"
          json:
            name: "user2"
            password: "password120"
          capture:
           - json: "$.accessToken"
             as: "accessToken"
      - loop:
          - function: "generateRandomDate"
          - get:
              url: "/franchise/120/countries?start={{ startDate }}&end={{ endDate }}"
              headers:
                Authorization: "Bearer {{ accessToken }}"
              afterResponse: "printStatus"
          - think: 1
        count: 5